# 30 days of R/Python

## Day 6: Filtering using .iloc[]

In [1]:
# import necessary libraries
import pandas as pd

In [3]:
# Create my_cats dictionary
my_cats = {
    "Names" : ["Puss", "TigerLilly", "MaryGold", "SnapDragon", "Morty", "Topaz"],
    "Status" : ["Angel", "Living", "Living", "Living", "Living", "Angel"],
    "Sex" : ["M", "F", "F", "M", "M", "F"],
    "Age" : [18, 15, 14, 11, 9, 16],
    "Nickname" : ["BoyBlue", "Tigs", "MerB", "Nappa", "MortMort", "Toaps"]
}

In [5]:
# Create a data frame from the my_cats dictionary
my_cats_df = pd.DataFrame(my_cats, index = ["Cat_1","Cat_2", "Cat_3", "Cat_4", "Cat_5", "Cat_6"])
print(my_cats_df)

            Names  Status Sex  Age  Nickname
Cat_1        Puss   Angel   M   18   BoyBlue
Cat_2  TigerLilly  Living   F   15      Tigs
Cat_3    MaryGold  Living   F   14      MerB
Cat_4  SnapDragon  Living   M   11     Nappa
Cat_5       Morty  Living   M    9  MortMort
Cat_6       Topaz   Angel   F   16     Toaps

In [7]:
# Select the first row using .iloc[]
my_cats_df.iloc[0]

Names          Puss
Status        Angel
Sex               M
Age              18
Nickname    BoyBlue
Name: Cat_1, dtype: object

In [17]:
# Select multiple rows using .iloc[]
my_cats_df.iloc[[1,2,5]]

            Names  Status Sex  Age Nickname
Cat_2  TigerLilly  Living   F   15     Tigs
Cat_3    MaryGold  Living   F   14     MerB
Cat_6       Topaz   Angel   F   16    Toaps

In [18]:
# Select a slice of rows using .iloc[] Note: excludes range end value
my_cats_df.iloc[1:4]

            Names  Status Sex  Age Nickname
Cat_2  TigerLilly  Living   F   15     Tigs
Cat_3    MaryGold  Living   F   14     MerB
Cat_4  SnapDragon  Living   M   11    Nappa

In [19]:
# Select a single column using .iloc[]
my_cats_df.iloc[ :,3]

Cat_1    18
Cat_2    15
Cat_3    14
Cat_4    11
Cat_5     9
Cat_6    16
Name: Age, dtype: int64

In [20]:
# Select multiple columns using .iloc[]
my_cats_df.iloc[:, [0,4]]

            Names  Nickname
Cat_1        Puss   BoyBlue
Cat_2  TigerLilly      Tigs
Cat_3    MaryGold      MerB
Cat_4  SnapDragon     Nappa
Cat_5       Morty  MortMort
Cat_6       Topaz     Toaps

In [21]:
# Select a slice of columns using .iloc[]
my_cats_df.iloc[:, 0:3]

            Names  Status Sex
Cat_1        Puss   Angel   M
Cat_2  TigerLilly  Living   F
Cat_3    MaryGold  Living   F
Cat_4  SnapDragon  Living   M
Cat_5       Morty  Living   M
Cat_6       Topaz   Angel   F

In [22]:
# Combined row and column selection using .iloc[]
my_cats_df.iloc[[0, 1, 2, 3] , [0, 4]]

            Names Nickname
Cat_1        Puss  BoyBlue
Cat_2  TigerLilly     Tigs
Cat_3    MaryGold     MerB
Cat_4  SnapDragon    Nappa

# Summary

Use .iloc[] when you know the integer positions of the rows/columns.